Catalogs/фин_КлассификаторНаборовДополнительныхРазрезов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>фин_КлассификаторНаборовДополнительныхРазрезов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Разрез1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрез2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрез3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрез4</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрез5</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрез6</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрез7</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрез8</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрез9</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрез10</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/фин_НастройкаДополнительныхРазрезовБюджетирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>фин_НастройкаДополнительныхРазрезовБюджетирования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Разрез</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.фин_ВидыСубконтоБюджетирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДляКомплектаБюджетов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Измерение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ФактическиеПоказателиБюджетирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/фин_КлассификаторНаборовДополнительныхРазрезов/Forms/ФормаВыбора/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкаДополнительныхРазрезовБюджетирования.Измерение,
		|	НастройкаДополнительныхРазрезовБюджетирования.Разрез
		|ИЗ
		|	РегистрСведений.фин_НастройкаДополнительныхРазрезовБюджетирования КАК НастройкаДополнительныхРазрезовБюджетирования";

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();

	ОбработанныеРазрезы=Новый Массив;
	Пока Выборка.Следующий() Цикл
		ИмяРазреза = фин_ПроцедурыМеханизмовБюджетирования.ИмяРазреза(Выборка.Измерение);
		НомерРазреза = Сред(ИмяРазреза,СтрДлина("Разрез")+1);
		ЭтотОбъект["ТипРазреза"+НомерРазреза]=Выборка.Разрез;
		Элементы.Список.ПодчиненныеЭлементы["Разрез"+НомерРазреза].Заголовок = ?(СокрЛП(Выборка.Разрез.ПредставлениеДополнительногоРеквизита)="",Строка(Выборка.Разрез),Выборка.Разрез.ПредставлениеДополнительногоРеквизита);
		Элементы["ИспользоватьОтбор"+НомерРазреза].Заголовок = Элементы.Список.ПодчиненныеЭлементы["Разрез"+НомерРазреза].Заголовок;
		Элементы["ОтборРазрез"+НомерРазреза].ОграничениеТипа = Выборка.Разрез.ТипЗначения;
		ОбработанныеРазрезы.Добавить(ИмяРазреза);
	КонецЦикла;
	Для Инд=1 По 10 Цикл
		имяЭлемента = "Разрез"+Строка(Инд);
		Если ОбработанныеРазрезы.Найти(имяЭлемента)=Неопределено Тогда
			Элементы["Отбор"+Строка(Инд)].Видимость=Ложь;
			Элементы.Список.ПодчиненныеЭлементы[имяЭлемента].Видимость=Ложь;
		КонецЕсли;
	КонецЦикла;
    НастроитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтбор1ПриИзменении(Элемент)
    НастроитьОтбор();
КонецПроцедуры

&НаСервере
Процедура НастроитьОтбор()
	Для Инд=1 По 10 Цикл
		Список.Параметры.УстановитьЗначениеПараметра("ИспользоватьОтбор"+Строка(Инд),ЭтотОбъект["ИспользоватьОтбор"+Строка(Инд)]);
		Список.Параметры.УстановитьЗначениеПараметра("ОтборРазрез"+Строка(Инд),ЭтотОбъект["ОтборРазрез"+Строка(Инд)]);
	КонецЦикла;
КонецПроцедуры
